build/docs/runtime/components/guard/del_user/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title><code>del_user</code> route of the <code>Guard</code> component</title>
<!-- 2017-04-27 Thu 09:32 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="VLEAD" />
<link rel="stylesheet" type="text/css" href="../../../style/css/worg-style.css" />
<link rel="stylesheet" type="text/css" href="../../../style/css/override.css" />
<link rel="icon" type="image/png" href="../../../style/img/favicon/popl.png" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../../../../index.html"> HOME </a>
</div><div id="content">
<h1 class="title"><code>del_user</code> route of the <code>Guard</code> component</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Checks</a></li>
<li><a href="#sec-3">3. Implementation</a>
<ul>
<li><a href="#sec-3-1">3.1. Imports and class <code>DelUser</code></a></li>
<li><a href="#sec-3-2">3.2. The type structure of the <code>del_user</code> route</a></li>
<li><a href="#sec-3-3">3.3. The <code>do</code> method</a></li>
</ul>
</li>
<li><a href="#sec-4">4. Checks</a>
<ul>
<li><a href="#sec-4-1">4.1. Type checks</a></li>
<li><a href="#sec-4-2">4.2. Authorization check</a>
<ul>
<li><a href="#sec-4-2-1">4.2.1. Steps</a></li>
</ul>
</li>
<li><a href="#sec-4-3">4.3. State check</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This is the specification and implementation of the
<code>del_user</code> route of the <code>Guard</code> component.  
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Checks</h2>
<div class="outline-text-2" id="text-2">
<dl class="org-dl">
<dt> TypeCheck </dt><dd>Check whether the instruction satisfies
the  <a href="../../../datatypes/instr/del_user/index.html"><code>DelUserInstr.is_inst</code></a> predicate.
</dd>
</dl>


<dl class="org-dl">
<dt> AuthCheck </dt><dd>Check whether the role in the <code>del_user</code>
instruction's session is <code>admin</code>.  Only admins are
allowed to create or delete users.
</dd>
</dl>


<dl class="org-dl">
<dt> StateCheck </dt><dd>Check whether the session in the
instruction is indeed an entity currently present in
the entity manager's session aggregate.  
</dd>
</dl>


<p>
Note that there is a referential integrity constraint that
the user being deleted is present in the entity manager's
aggregate.  This constraint is checked by the safe entity
manager, so there is no need to check it in the guard.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Implementation</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Imports and class <code>DelUser</code></h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-python"><span style="font-weight: bold;">import</span> traceback
<span style="font-weight: bold;">from</span> runtime.exceptions.app.exception <span style="font-weight: bold;">import</span> AppException
<span style="font-weight: bold;">from</span> runtime.utils.type_utils.type_utils <span style="font-weight: bold;">import</span> check_pred
<span style="font-weight: bold;">from</span> runtime.datatypes.cmd.cmd <span style="font-weight: bold;">import</span> Cmd
<span style="font-weight: bold;">from</span> runtime.objects.session.session <span style="font-weight: bold;">import</span> Session
<span style="font-weight: bold;">from</span> runtime.objects.role.role <span style="font-weight: bold;">import</span> Role
<span style="font-weight: bold;">from</span> runtime.datatypes.instr.del_user.del_user_instr <span style="font-weight: bold;">import</span> DelUserInstr

<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">DelUser</span>:
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> The type structure of the <code>del_user</code> route</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The <code>del_user</code> route is a dictionary with 'cmd' equal to
<code>Cmd.del_user</code>, a 'session' that is an instance of
<code>Session</code> and data, which is a dictionary with one field
'user' of type <code>User.is_inst</code>.
</p>
</div>
</div>

<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> The <code>do</code> method</h3>
<div class="outline-text-3" id="text-3-3">
<p>
The <code>do</code> method simply does all the checks.  
</p>
<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold; text-decoration: underline;">@staticmethod</span> 
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">do</span>(obj, instr):
        <span style="font-weight: bold;">print</span> <span style="font-style: italic;">"del_user: %s"</span> % instr

        DelUser.check_type(instr)
        DelUser.check_auth(obj, instr)
        DelUser.check_state(obj, instr)
        <span style="font-weight: bold;">return</span> instr
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Checks</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Type checks</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Check if the the instruction if of correct shape,
i.e. satisfies predicate <code>DelUserInstr.is_inst</code>
</p>

<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold; text-decoration: underline;">@staticmethod</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">check_type</span>(instr):
        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">replace the next line with your code</span>
        <span style="font-weight: bold;">pass</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Authorization check</h3>
<div class="outline-text-3" id="text-4-2">
<p>
The Authorization checks for the following two authorization
constraints:
</p>

<ol class="org-ol">
<li>Only an <code>admin</code> may perform the <code>del_user</code> operation
</li>

<li>A user can not delete himself/herself.
</li>
</ol>
</div>



<div id="outline-container-sec-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> Steps</h4>
<div class="outline-text-4" id="text-4-2-1">
<ol class="org-ol">
<li>Retrieve the session from the instr
</li>

<li>Retrieve the user from the session
</li>

<li>Retrieve the role from the session
</li>

<li>If the role is not an admin role (<code>Role.admin</code>) then
raise an exception.
</li>

<li>Get the user to be delete from the instruction's data
key.
</li>

<li>If the session's user is the same as the user to be
deleted, raise an exception.
</li>
</ol>


<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold; text-decoration: underline;">@staticmethod</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">check_auth</span>(obj, instr):
        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">replace the next line with your code</span>
        <span style="font-weight: bold;">pass</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> State check</h3>
<div class="outline-text-3" id="text-4-3">
<p>
This check passes if the session is already an entity
present in the entity manager.  Otherwise an <code>AppException</code>
is raised.
</p>


<ol class="org-ol">
<li>Retrieve the session from the instruction.
</li>

<li>Retrieve the entity manager from the component.
</li>

<li>Check if the session is present in the entity
manager. 
</li>

<li>If the session is not present, then raise an
exception.  The instruction's session must always be
in the session aggregate managed by the entity
manager.
</li>
</ol>

<div class="org-src-container">

<pre class="src src-python">    <span style="font-weight: bold; text-decoration: underline;">@staticmethod</span>
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">check_state</span>(obj, instr):
        <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">replace the next line with your code</span>
        <span style="font-weight: bold;">pass</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">[2017-04-25 Tue]</span></span></p>
<p class="author">Author: VLEAD</p>
<p class="date">Created: 2017-04-27 Thu 09:32</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
